In [2]:
import pandas as pd
import math

In [3]:
data = {
    'Shop_Name': ['Starbucks', 'Blue Bottle', 'Dunkin', 'Peets', 'Starbucks', 'La Colombe', 'Blue Bottle', 'Peets', 'Starbucks', 'Dunkin'],
    'Location': ['Hollywood', 'San Diego', 'San Diego', 'Hollywood', 'New York', 'New York', 'Hollywood', 'San Diego', 'New York', 'Hollywood'],
    'Rating': [4.5, 4.7, 4.1, 4.3, 4.5, 4.8, 4.6, 4.2, 4.4, 3.9],
    'Type': ['Chain', 'Independent', 'Chain', 'Chain', 'Chain', 'Independent', 'Independent', 'Chain', 'Chain', 'Chain']
}

coffee_shops = pd.DataFrame(data)

In [4]:
coffee_shops

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
2       Dunkin  San Diego     4.1        Chain
3        Peets  Hollywood     4.3        Chain
4    Starbucks   New York     4.5        Chain
5   La Colombe   New York     4.8  Independent
6  Blue Bottle  Hollywood     4.6  Independent
7        Peets  San Diego     4.2        Chain
8    Starbucks   New York     4.4        Chain
9       Dunkin  Hollywood     3.9        Chain

### iterating_through_groups

#### 1) How can you iterate through each group created by grouping the DataFrame by the 'Location' column, and print the name of each location along with the number of shops in that location?

In [5]:
coffee_shops.groupby('Location').count()

           Shop_Name  Rating  Type
Location
Hollywood          4       4     4
New York           3       3     3
San Diego          3       3     3

In [6]:
grouped = coffee_shops.groupby('Location')

In [7]:
for name, group in grouped:
    print(f"Location '{name}': ", end='')
    print(f"{len(group)} shops")
    print()

Location 'Hollywood': 4 shops

Location 'New York': 3 shops

Location 'San Diego': 3 shops

#### 2) Iterate through the groups formed by 'Type' and 'Location' and calculate the average 'Rating' for each group, printing both the group identifiers and the corresponding average ratings.

In [8]:
for name,  group in coffee_shops.groupby(['Type', 'Location']):
    print(f"Group - {name} : ", end="")
    print(group.loc[:,'Rating'].mean())

Group - ('Chain', 'Hollywood') : 4.233333333333333
Group - ('Chain', 'New York') : 4.45
Group - ('Chain', 'San Diego') : 4.15
Group - ('Independent', 'Hollywood') : 4.6
Group - ('Independent', 'New York') : 4.8
Group - ('Independent', 'San Diego') : 4.7

#### 3) For each 'Type' of coffee shop, iterate through the groups formed by 'Location', and find the location with the highest total 'Rating' across all shops of that type.

In [9]:
type_grouped = coffee_shops.groupby('Type')

In [10]:
for type_name, type_group in type_grouped:
    print(f"{type_name} : ", end="")
    cur_max_for_type = -math.inf
    for loc_name, loc_group in type_group.groupby('Location'):
        cur_loc_sum = loc_group.loc[:, 'Rating'].sum()
        if cur_loc_sum > cur_max_for_type:
            cur_max_for_type = cur_loc_sum
    print(cur_max_for_type)

Chain : 12.700000000000001
Independent : 4.8

#### 4) Iterate through the groups formed by 'Type' and 'Location', and find the location with the lowest median 'Price' for each type, printing both the type and location.

#### 5) How can you loop through each group based on 'Location' and find the shop with the highest 'Rating' within each location, printing the location name and the shop name?

#### 6) For each group formed by 'Type', 'Location', and 'Price_Category', iterate through the data and count how many shops belong to each 'Price_Category' within each group.

#### 7) Loop through the groups formed by 'Type' and 'Location', and find the shop with the lowest 'Rating' within each location, printing the location name and the shop name.

#### 8) Iterate through each group based on 'Type' and calculate the sum of 'Rating' for all shops of that type, printing the type and the total rating.

#### 9) For each 'Location' group, iterate through the data and find the shop with the highest 'Price' within that location, printing the location name and the shop name.

#### 10) How can you loop through each group formed by 'Type' and 'Location', and calculate the percentage of 'Chain' shops within each location, printing the location name and the percentage?